{
	"name": "Wynn Slater",
	"contact": {
		"email": "wynn.slater@gmail.com"
	},
	"summary": "An individual experienced as a Software Developer who works well in a fast paced environment. Always maintains a positive attitude and knows how to build strong relationships with internal and external stakeholders. Is highly trustworthy and poised in interactions with others at all levels. Has the ability to handle challenging tasks in a calm and confident manner. Would be an asset to any organization seeking someone who can make a positive contribution.",
	"strengths": [
		"Excellent interpersonal skills and customer focused",
		"Ability to work equally well in a team or alone",
		"Highly adaptable with a broad range of transferable skills",
		"Ability to multi-task without losing focus",
		"Quick to understand new assignments and works well with minimal supervision",
		"A good listener and is able to absorb information and translate it into easily understood terms",
		"Analytical, creative and driven to improve processes to reduce workload and improve efficiency",
		"Able to define, communicate and fulfill project goals and break complex issues into manageable parts"
	],
	"competencies": [
		"Analytical problem solver",
		"Resourceful",
		"Responsible/accurate",
		"Software implementation",
		"Application debugging",
		"Punctual"
	],
	"history": [
		{
			"company": "Underwriters Laboratories",
			"location": "Kelowna, BC",
			"duration": {
				"start":2012,
				"end":2016
			},
			"positions": [
				{
					"title": "Software Developer",
					"responsibilities": [
						"Developed and maintained new web applications",
						"Maintained existing web applications",
						"Worked with project managers to plan and schedule new features",
						"Tracked down and fixed defects"
					],
					"accomplishments": "The organization had multiple methods to deliver training content and multiple sources, all requiring separate handling. I worked with project management and server-side developers to build an internal CMS which acted as a single point to deal with all training content which simplified workflows within the company. PureSafety login help was a problem because there were too many support calls about logging into the application, especially with users forgetting usernames and passwords. I developed a dynamic help wizard to take the user through identifying their company name, username and reset their password if necessary. This resulted in a significant drop in support calls and Custom Google Analytics integration enabled us to see which steps were problematic."
				}
			]
		},
		{
			"company": "PureSafety",
			"note": "Acquired by Underwriters Laboratories",
			"location": "Kelowna, BC",
			"duration": {
				"start":2001,
				"end":2012
			},
			"positions": [
				{
					"title": "User Experience Developer",
					"duration": {
						"start":2009,
						"end":2012
					},
					"responsibilities": [
						"Developed training platform software",
						"Developed authoring tools for training",
						"Developed new areas of PureSafety LMS"

					],
					"accomplishments": "Changing Javascript code was causing other things to break. I implemented Javascript unit tests and set them up to run continuously which resulted in breaking changes being found. Wrote new code with unit testing in mind which was more robust and well organized. PureSafety LMS needed a way to send internal messages between users. I added a new area to the application with rich-text messaging which resulted in users without email addresses being able to get messages from their managers or from the system."
				},
				{
					"title": "Courseware Developer",
					"duration":{
						"start":2001,
						"end":2009
					},
					"responsibilities": [
						"Developed internal tools for courseware developers",
						"Developed internal tool for time tracking and forecasting",
						"Developed flexible, robust training platforms for rich-media presentations",
						"Integrated training platforms with SCORM and AICC Learning Management System",
						"Built rich-media training presentations"
					],
					"accomplishments": "We needed a flexible way to distribute our rich-media content. I developed and built and XML-based presentation which handles synchronization of text, images and sound, animation, dynamic preloading of assets, interactive learning activities and integrated testing. It took most of an entire work day for the office manager to input and collate all logged work time from Oracle by hand. I wrote a series of Visual Basic for applications in Excel to extract and collate Oracle data by employee and client project, generate development forecasts, generate reports and compare versions of reports from different dates by user-definable criteria. This resulted in reports and forecasts that were completed in minutes rather than several hours."
				}
			]
		},
		{
			"company": "Kaede Graphics and Design",
			"note": "Acquired by PureSafety",
			"location": "Westbank, BC",
			"duration": {
				"start":2000,
				"end":2001
			},
			"positions":[
				{
					"title": "Courseware Developer"
				}
			]
		}
	],
	"education":[
		{
			"name": "Okanagan University",
			"location": "Kelowna, BC",
			"education": "Bachelor of Science, Computer Science (partial completion)"
		},
		{
			"name": "George Pringe Secondary School",
			"location": "Westbank, BC",
			"education": "Highschool Diploma"
		}
	],
	"training":[
		"ECMAScript 6",
		"Unit Testing",
		"Angular JS",
		"T-SQL Fundamentals",
		"React Fundamentals",
		"Web Application Security Risks for ASP.NET"
	],
	"software":[
		"Visual Studio",
		"Webstorm",
		"Git",
		"npm",
		"Fiddler",
		"Adobe Flash",
		"Adobe Photohop",
		"Team Foundation Server",
		"IIS"
	],
	"skills":[
		"JavaScript",
		"AngularJS",
		"Ext JS",
		"jQuery",
		"CSS/Less",
		"Jasmine",
		"Node.js",
		"ASPX",
		"CSHTML (Razor)",
		"ActionScript 2 and 3",
		"C#",
		"Excel (VBA)"
	]
}